In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [17]:
df['NOVO'] = df['W'] = df['X']

In [18]:
df = df.drop('NOVO', axis = 1)

In [19]:
df

          W         X         Y         Z
A  0.628133  0.628133  0.907969  0.503826
B -0.319318 -0.319318 -0.848077  0.605965
C  0.740122  0.740122  0.528813 -0.589001
D -0.758872 -0.758872 -0.933237  0.955057
E  1.978757  1.978757  2.605967  0.683509

In [21]:
df.drop('C', axis = 0)

          W         X         Y         Z
A  0.628133  0.628133  0.907969  0.503826
B -0.319318 -0.319318 -0.848077  0.605965
D -0.758872 -0.758872 -0.933237  0.955057
E  1.978757  1.978757  2.605967  0.683509

In [22]:
df.loc['B']

W   -0.319318
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [24]:
df.iloc[2]

W    0.740122
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [25]:
df.loc['D', 'X']

-0.758872056210466

In [27]:
df.loc[['A', 'B', 'C'], ['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813

In [28]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B  False  False  False   True
C   True   True   True  False
D  False  False  False   True
E   True   True   True   True

In [29]:
df[df > 0]

          W         X         Y         Z
A  0.628133  0.628133  0.907969  0.503826
B       NaN       NaN       NaN  0.605965
C  0.740122  0.740122  0.528813       NaN
D       NaN       NaN       NaN  0.955057
E  1.978757  1.978757  2.605967  0.683509

In [30]:
df[df['X'] > 0]

          W         X         Y         Z
A  0.628133  0.628133  0.907969  0.503826
C  0.740122  0.740122  0.528813 -0.589001
E  1.978757  1.978757  2.605967  0.683509

In [32]:
df[(df['X'] > 0) & (df['W'] > 1)]

          W         X         Y         Z
E  1.978757  1.978757  2.605967  0.683509